{
  "summary": "Alice, a young girl, embarks on a surreal journey into a fantastical world after following a White Rabbit down a rabbit-hole. Her descent is a long fall, during which she observes cupboards and bookshelves. Upon reaching a strange hall, she encounters various objects that alter her size, beginning with a bottle labeled \"DRINK ME\" that shrinks her, allowing her access to a beautiful garden through a small door, but she realizes she left the key behind. After growing enormous by eating a cake labeled \"EAT ME,\" she fills a pool with her tears, attracting a variety of damp creatures, including a Mouse. These creatures, including a Dodo and an Eaglet, participate in a \"Caucus-race\" to dry off, after which Alice distributes prizes. The Mouse begins to recount its history, but Alice's misunderstandings cause it to depart. Alice then encounters the White Rabbit, who mistakes her for his housemaid, Mary Ann, and sends her to fetch his fan and gloves. In his house, she drinks from another bottle and grows so large she fills the entire room, leading to a chaotic escape and subsequent shrinking. Fleeing into a wood, Alice encounters a large puppy and then a hookah-smoking Caterpillar, who questions her identity due to her fluctuating size. Using pieces of a mushroom, Alice further manipulates her size, growing immense and then shrinking drastically, even being mistaken for a serpent by a Pigeon. She eventually finds a small house and shrinks again to enter it. Inside, she witnesses a chaotic kitchen scene with the Duchess, her baby, and a cook. The Duchess explains the origin of the Cheshire Cat's grin before handing her pepper-scattering baby to Alice. The baby transforms into a pig, which Alice leaves in the wood. Meeting the Cheshire Cat again, Alice learns about the Mad Hatter and March Hare. The Cat later joins Alice in observing the Queen of Hearts' croquet game, a chaotic match played with live flamingos and hedgehogs, governed by the Queen's arbitrary \"Off with their heads!\" decrees. Alice is summoned to see the Mock Turtle and Gryphon, who share bizarre stories of their schooldays and the \"Lobster Quadrille.\" Alice finally reaches the beautiful garden, having navigated a mushroom and a long hall, where she sees gardeners painting white roses red to appease the Queen. The Queen arrives with her court of cards, and Alice boldly defies her. The Queen orders the gardeners' execution, but Alice intervenes. After rejoining the croquet game, Alice meets the Mock Turtle and Gryphon again, who tell more peculiar stories. Alice's journey is characterized by constant transformations, nonsensical encounters, and the struggle to make sense of an illogical world. Later, Alice engages in bewildering conversations with the Gryphon and Mock Turtle, filled with wordplay and nonsensical logic concerning \"blacking\" and \"whiting.\" The Mock Turtle asks Alice to recount her adventures, which she begins, detailing her experiences from meeting the White Rabbit. The Gryphon grows impatient, and Alice's repetition of \"You are old, Father William\" is deemed \"very curious.\" The Gryphon then asks Alice to recite \"'Tis the voice of the sluggard,'\" but Alice recites a nonsensical version about a lobster, amusing her companions. The scene shifts to a trial where the Knave of Hearts is accused of stealing tarts made by the Queen. Alice is in court as the jury, composed of twelve creatures, diligently writes their names. The Hatter, March Hare, and Dormouse are called as witnesses, providing nonsensical testimonies about tea and hats. The King questions the Hatter about his hat, which is noted as stolen. Alice begins to grow larger, disrupting the proceedings. The Duchess's cook and the White Rabbit are called, but the cook's testimony about tarts is pepper-based and the Dormouse's interjection is \"Treacle.\" Alice, now very large, is called as a witness, knocking over the jury-box. When asked what she knows, she states \"Nothing.\" Rule Forty-two is invoked, requiring anyone over a mile high to leave, which Alice protests. The White Rabbit presents verses as evidence, which Alice finds meaningless and unexplainable. The King attempts to interpret them, but Alice points out inconsistencies. The Queen demands \"Sentence first—verdict afterwards,\" and when Alice protests, the Queen shouts, \"Off with her head!\" Alice, now her full size, declares them \"nothing but a pack of cards,\" and they attack her. Alice wakes up on the bank, realizing it was all a dream, and recounts her adventures to her sister.",
  "title": "Alice's Adventures in Wonderland",
  "authors": [
    {
      "birth_year": 1832,
      "death_year": 1898,
      "name": "Carroll, Lewis"
    }
  ],
  "themes": [
    "fantasy",
    "surrealism",
    "absurdism",
    "coming of age",
    "imagination"
  ],
  "gutenberg_id": 11
}