{
  "summary": "The narrative of Mary Shelley's \"Frankenstein; or, The Modern Prometheus\" begins with Captain Robert Walton, an ambitious explorer, writing to his sister from St. Petersburg about his expedition to the North Pole. Driven by a thirst for knowledge and discovery, Walton laments his loneliness and his desire for a like-minded friend. His journey progresses as he hires a ship and crew, encountering difficulties with ice floes. During this period, they rescue a frozen European, Victor Frankenstein, who begins to recount his life story. Victor, born in Geneva, describes his idyllic childhood, his close friendship with Henry Clerval, and his formative years influenced by both arcane texts and scientific discovery. A pivotal moment arises from a thunderstorm, leading him to pursue natural philosophy. At the University of Ingolstadt, Victor becomes consumed by the desire to uncover the secrets of life and death, leading him to the morally ambiguous task of creating a human being. He meticulously gathers materials and assembles a creature of immense size, which he then animates. Upon witnessing its grotesque appearance, Victor is overcome with horror and disgust, fleeing from his creation. During his recovery, aided by Clerval, Victor learns of his younger brother William's murder and the subsequent accusation of Justine Moritz. Victor knows his creature is the culprit but remains silent, fearing disbelief. Justine is wrongly condemned and executed, deepening Victor's guilt and despair. Seeking solace in the desolate Alpine valleys, Victor encounters his creature, who recounts his own tragic story of isolation, learning language through observation of the De Lacey family, and suffering rejection due to his appearance. The creature demands Victor create a female companion for him, threatening vengeance if refused. Victor, tormented and fearing for his loved ones, agrees. He journeys to England and Scotland to fulfill this promise, working in the remote Orkney Islands. However, he destroys the half-finished second creature, prompting the creature to vow revenge, specifically targeting Victor's wedding night. Fleeing the Orkneys, Victor lands in Ireland and is accused of murdering his friend Henry Clerval, the creature's vengeance manifesting prematurely. Victor is eventually cleared but remains consumed by grief. Elizabeth Lavenza, Victor's cousin and fiancée, expresses her anxieties about their marriage. Victor agrees to marry her, intending to confront the creature on their wedding night to protect his family. Tragically, the creature murders Elizabeth instead. Devastated, Victor vows relentless pursuit of his creation. He recounts his chase across vast landscapes, eventually finding himself aboard Walton's ship. Dying and exhausted, Victor implores Walton to continue the hunt. The creature appears to Walton, lamenting his actions and his descent from a benevolent being to one consumed by despair and vengeance due to humanity's rejection. He declares his work complete and intends to immolate himself in the Arctic wilderness, ending his torment. The creature then leaps onto an ice raft and disappears, signifying the tragic conclusion of his existence and Victor's life.",
  "title": "Frankenstein; Or, The Modern Prometheus",
  "authors": [
    {
      "birth_year": 1797,
      "death_year": 1851,
      "name": "Shelley, Mary Wollstonecraft"
    }
  ],
  "themes": [
    "creation and responsibility",
    "revenge",
    "isolation",
    "prejudice",
    "ambition",
    "guilt",
    "the sublime",
    "nature vs nurture",
    "the uncanny"
  ],
  "gutenberg_id": 84
}